In [1]:
#How Python Aggregate Data?
#To apply aggregations on our datasets, we can use the Python numpy library along with pandas.

In [2]:
import pandas as pd
import numpy as np

In [3]:
two=pd.read_csv(r'C:\Users\slowjerm.jerm1\Desktop\dataScience\data aggregation&Wrangling\supermarket1.csv')
two

   Unnamed: 0  emp_id    dept_name  aisle
0           0       1        duvet      1
1           1       2        bidet      2
2           2       3     footwear      3
3           3       4     clothing      4
4           4       5  electronics      5

In [4]:
#deleting unnecassary column

del two['Unnamed: 0']
two

   emp_id    dept_name  aisle
0       1        duvet      1
1       2        bidet      2
2       3     footwear      3
3       4     clothing      4
4       5  electronics      5

In [6]:
Python Aggregating an entire dataframe

two.aggregate(np.sum)

emp_id                                          15
dept_name    duvetbidetfootwearclothingelectronics
aisle                                           15
dtype: object

In [7]:
'''As you can see, this keeps aggregating the previous value into itself. Another aggregation we can use is max-'''

two.aggregate(np.max)

emp_id              5
dept_name    footwear
aisle               5
dtype: object

In [8]:
'''Other aggregations include mean, median, and min.'''

two.aggregate(np.min)

emp_id           1
dept_name    bidet
aisle            1
dtype: object

In [9]:
two.aggregate(np.mean)

emp_id    3.0
aisle     3.0
dtype: float64

In [10]:
two.aggregate(np.median)

emp_id    3.0
aisle     3.0
dtype: float64

In [12]:
'''Python Aggregating one column
To aggregate just one column, we can use its index.'''

two['aisle'].aggregate(np.mean)

3.0

In [13]:
'''Python Aggregating multiple columns
We can also specify more than one column to aggregate.'''
two[['aisle','emp_id']].aggregate(np.sum)

aisle     15
emp_id    15
dtype: int64